app/views/homes/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."home_id" = $1 LIMIT 1  [["home_id", 18]]
---
      <div class='comments'>
        <% if @home.comments.any? %>