app/controllers/homes_controller.rb

  def create
    new_params = home_params.merge({user_id: cookies[:user_id]})
    @home = Home.create(new_params)
---
INSERT INTO "homes" ("title", "street_address", "city", "state", "zip_code", "neighborhood", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def show

    @home = Home.find(params[:id])
---
SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT 1  [["id", 1]]