app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "House in Vienna"], ["image", "Tacky Lights"], ["created_at", "2016-10-01 20:58:31.157431"], ["updated_at", "2016-10-01 20:58:31.157431"]]
---
  def create
    @picture = Picture.create(params[:id])

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_picture
      @picture = Picture.find(params[:id])