app/controllers/users_controller.rb

  def create
    new_user = User.new
    new_user.username = params[:user_name]
    new_user.password = params[:password]

    new_user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "blah"], ["password", "blah"], ["created_at", "2016-11-26 22:06:16.767272"], ["updated_at", "2016-11-26 22:06:16.767272"]]

  def login
    user_name = params[:user_name]
    user = User.find_by_username(user_name)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "blah"]]

  def update
    user = User.find(params[:id])
    user.password = params[:password]
    user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password", "omg"], ["updated_at", "2016-11-26 23:08:31.422750"], ["id", 1]]