app/controllers/user_controller.rb

  def create
    @user = User.new(user_params)

    @user.save
---
INSERT INTO "users" ("name", "birth_year", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "blah"], ["birth_year", 1234], ["created_at", "2016-10-03 19:05:48.804175"], ["updated_at", "2016-10-03 19:05:48.804175"]]